Repository: M-a-r-i-a-n-n-e/MultiGeiger
Catalog: locales/*/LC_MESSAGES/deployment.po
Languages: de

source: Deployment
de: Aufstellung

source: When deploying the MultiGeiger measurement station, you need to consider some things.
de: Bei der Aufstellung der Multigeigermesstation sind einige Punkte zu beachten.

source: Of course, for us private persons, there rarely will be a 100% perfect deployment place. But still, we can be aware of the parameters which may have a negative impact.
de: Natürlich wird es, bei uns Privatleuten, selten einen 100% perfekten Aufstellort geben. Dennoch sollten wir uns bewusst sein welche Parameter negative Einflüsse haben können.

source: Requirements for the deployment place
de: Anforderungen an den Aufstellort

source: In any case we need this at the deployment place:
de: Auf jeden Fall brauchen wir am Aufstellort:

source: WiFi or LoRa reception for data transmission (A)
de: WLAN oder LoRa Empfang für die Datenübertragung (A)

source: WiFi can come from inside the house, LoRa from some TTN LoRa gateway.
de: Für WLAN kann das Netz aus einem Gebäude verwendet werden, für LoRa das Netz eines TTN LoRa Gateways.

source: Power: 5 V / ~ 100 mA (B)
de: Stromversorgung: 5 V / ~ 100 mA (B)

source: Power can come from inside the house via a 5V cable or from other power supply.
de: Strom kann durch eine 5V Leitung aus dem Gebäude oder aus einer anderen Stromquelle bezogen werden.

source: Irrigation area (C)
de: Abregnenfläche (C)

source: E.g. some lawn, meadow or similar that gets some rainfall, potentially including fallout.
de: Z. B. Rasen, Wiese o. ä. worauf Regen fällt, der potentiell radioaktiven Niederschlag „Fallout“ enthält.

source: Choosing a deployment place
de: Wahl des Aufstellungsorts

source: We want to measure radioactive substances (dust), also known as "fallout". They come from e.g. nuclear explosions or reactor desasters.
de: Was wir mit unserem Gerät nachweisen wollen sind radioaktive Stoffe (Stäube), die man auch "Fallout" nennt. Sie entstehen z. B. bei Atombombenexplosionen und Reaktorkatastrophen.

source: In a very weak variant, they also naturally come from the atmosphere due to the decay of the radioactive noble gas radon. This "radon fallout" causes a small, but measurable peak on our devices, which degrades with a half life of 45 minutes.
de: In sehr schwacher Form entstehen sie natürlicherweise auch in der Atmosphäre auch durch den Zerfall des radioaktiven Edelgases Radon. Auch dieser "Radon-Fallout" erzeugt bei unseren Geräten einen kleinen, aber messbaren, Ausschlag, der sich in etwa mit einer Halbwertszeit von 45 Minuten wieder abbaut.

source: With the help of these "radon peaks", we can see whether our device is deployed to a good place and is sensitive also for "real" fallout.
de: Anhand dieser „Radon-Peaks“ können wir sehen ob unser Gerät gut aufgestellt ist und auch für „echten“ Fallout empfindlich ist.

source: Irrigation area
de: Abregenfläche

source: We need a bigger irrigation area in the direct vicinity of the measurement station. This area should also have the capability to hold and store radioactive particles.
de: Wir brauchen in direkter Umgebung der Messtation eine größere Fläche auf die es regnen kann. Diese Fläche sollte auch die Möglichkeit haben radioaktive Partikel festzuhalten.

source: A lawn or a meadow is perfect for this.
de: Rasen oder Wiese ist hierfür perfekt.

source: On the other hand, some asphalt can not do that, because particles are washed away directly after raining down.
de: Eine Asphaltfläche dagegen kann dies nicht, da die Partikel direkt nach dem Abregnen sofort abgespült werden.

source: Wind direction
de: Windrichtung

source: The area should be unobstructed from the main wind direction by other buildings, bushes or trees.
de: Das Gelände sollte von der Hauptwindrichtung her unverbaut sein und auch Büsche oder Bäume sollten sich dort keine befinden.

source: Sun light
de: Sonnenlicht

source: The power supply cable as well as the MultiGeiger device itself, should be in the shadows most of the time.
de: Sowohl das 5 V-Kabel, als auch das Gerät selbst, sollten sich möglichst die meiste Zeit des Tages im Schatten befinden.

source: Direct sunlight can have two negative influences:
de: Direktes Sonnenlicht kann zweierlei negative Auswirkungen haben:

source: Heat: The temperature inside the device can rise to up to 60 deg celsius in direct sunshine (45 deg celsius in the shadows). We did practical temperature tests showing that the device works ok up to 70 deg celsius. But the GM tube is only specified to up to 50 deg celsius.
de: Hitze: Die Temperatur im Gerät kann in der Sonne auf bis zu 60 °C ansteigen (bei 45 °C im Schatten). Zwar haben unsere Temperaturtests gezeigt dass das Gerät bei 70 °C noch einwandfrei funktioniert. Jedoch ist das Zählrohr nur bis 50 °C spezifiziert.

source: UV damage: Over time, the cable and case can be damaged by UV radiation and get porous.
de: UV-Schäden: Direktes Sonnenlicht kann unser Gehäuse im Laufe der Jahre porös werden lassen und dadurch schädigen.

source: Examples
de: Beispiele

source: Examples of good and bad deployment places:
de: Beispielhafter Vergleich eines guten und eines schlechten Aufstellungsorts:

source: Comparison of two deployment places. Yellow is the "usable irrigation area".
de: Vergleich zweier Aufstellorte. Gelb ist die „Nutzbare Abregenfläche“.

source: Bad deployment place (red dot at the left)
de: Schlechter Aufstellungsort (linker roter Punkt)

source: Reasons:
de: Gründe:

source: Meadow: a bit part of the area around the GM device is made of concrete platter. Incapable of holding/storing fallout.
de: Wiese: Ein Großteil der Fläche um den Geigerzähler besteht aus Waschbetonplatten. Hier kann kein abgeregneter Fallout gespeichert werden.

source: Wind: the main wind direction is from the west and the tree obstructs fallout raining down close to the device.
de: Wind: Der Wind kommt hauptsächlich aus Westen und der Baum erschwert das Abladen des Fallouts in der Nähe des Zählrohrs.

source: Sun: Sunlight comes primarily from the south and strongly shines on the devices.
de: Sonne: Die Sonne kommt hauptsächlich von Süden und bestrahlt den Multigeiger stark.

source: Good deployment place (red dot at the right)
de: Guter Aufstellungsort (rechter roter Punkt)

source: Meadow: a big part of the area around the GM device is meadow, which can hold/store fallout.
de: Wiese: Ein Großteil der Fläche um den Geigerzähler besteht aus Wiese, die abgeregneten Fallout speichern kann.

source: Wind: no obstruction
de: Wind: Keine Hindernisse.

source: Sun: the GM device is in the shadow due to the garden shack.
de: Sonne: Der Geigerzähler wird gut vom Gartengeräteschuppen verschattet.

source: More Information
de: Weitere Informationen

source: Description of the BFS-ODL measurement network (german):
de: Beschreibung des BFS-ODL-Netzes:

source: Video interview about the BFS-ODL measurement network (german):
de: Videointerview über das BFS-ODL-Netz:
