Repository: M-a-r-i-a-n-n-e/MultiGeiger
Catalog: locales/*/LC_MESSAGES/setup.po
Languages: de

source: Download and unpack the latest release from GitHub ( https://github.com/ecocurious/MultiGeiger/releases ) as source code (zip) or source code (tar.gz). In the new directory, open the directory *multigeiger* and load the file *multigeiger.ino* with the Arduino IDE.
de: Auf GitHub die neueste Release ( https://github.com/ecocurious/MultiGeiger/releases ) als Source Code (zip) oder Source Code (tar.gz) herunterladen und entpacken. Mit der Arduino-IDE in dem neuen Verzeichnis die Datei multigeiger.ino im Verzeichnis multigeiger öffnen.

source: The board supports two different Heltec devices, different counting tubes and optionally a sensor for ambient temperature, air pressure, and humidity (BME280 or BME680). The software can send data via network to different services.
de: Die Platine unterstützt zwei verschiedene Heltec-Bausteine, verschiedene Zählrohre und optional einen Temperatur/Luftdruck/Luftfeuchtigkeits-Sensor (BME280 oder BME680). Die Software kann via Netzwerk Daten zu verschiedenen Services senden.

source: **Heltec WiFi Kit 32** This MCU has WiFi, a large display and plugged into the longer female connectors on the board.
de: **Heltec WiFi Kit 32** Diese MCU hat ein großes Display und WiFi. Auf dem Board wird dieser Baustein in die längeren Buchsenleisten gesteckt.

source: **Heltec Wireless Stick** This MCU has a very small display, and provides LoRa beside WiFi. It must be plugged into the shorter female headers on the board.
de: **Heltec Wireless Stick** Diese MCU hat ein sehr kleines Display, dafür aber zusätzlich zu WiFi noch LoRa. Es wird in die kürzeren Buchsenleisten gesteckt.

source: To select the Heltec boards in the Arduino IDE, the following steps must be taken:
de: Um die Heltec-Boards in der Arduino IDE auswählen zu können, müssen die folgenden Schritte unternommen werden:

source: Add the file: https://raw.githubusercontent.com/espressif/arduino-esp32/gh-pages/package_esp32_dev_index.json in Preferences->Additional Boards Manager URLs.
de: Die Datei: https://raw.githubusercontent.com/espressif/arduino-esp32/gh-pages/package_esp32_dev_index.json muss in Preferences->Additional Boards Manager URLs hinzugefügt werden.

source: Then, the ESP32 boards (name “esp32 by Espressif Systems”) can be installed under Tools->Board->Boards Manager. Choose the correct Heltec board under Tools->Board.
de: Danach können unter Tools->Board->Boards Manager die ESP32 Boards (Name "esp32 by Espressif Systems") installiert und anschließend unter Tools->Board das richtige Heltec Board ausgewählt werden.

source: Select the **Heltec wireless Stick** for **both** boards.
de: Für **beide** Boards muss hier der **Heltec wireless Stick** ausgewählt werden.

source: Select under Tools **Flash size: “4MB(32Mb)”** and **Partition Scheme: “Minimal SPIFFS (Large APPS with OTA)”**. The software recognizes automatically which board is equipped.
de: Unter Tools muss noch **Flash size: "4MB(32Mb)"** und **Partition Scheme: "Minimal SPIFFS (Large APPS with OTA)"** eingestellt werden. Die Software erkennt selbstständig, welches Board bestückt ist.

source: Various software settings can be made via the following files (see comments inside):
de: Diverse Software-Einstellungen kann man über folgende Dateien machen (siehe Kommentare dort):

source: **./multigeiger/userdefines.h** (always necessary, an example is provided in userdefines-example.h)
de: **./multigeiger/userdefines.h** (immer notwendig, ein Beispiel hierzu wird in userdefines-example.h mitgeliefert)

source: **./platformio.ini** (only for platformio, an example is provided in platformio-example.ini)
de: **./platformio.ini** (nur bei platformio, ein Beispiel hierzu wird in platformio-example.ini mitgeliefert)

source: All external libraries are required, which are listed in the file
de: Es werden alle externen Libraries benötigt, die aufgelistet sind in der Datei

source: under the section
de: unter dem Abschnitt

source: Please install the latest version via platform.io / Libraries.
de: Bitte die aktuellste Version über platform.io / Libraries installieren.

source: **Caution:** If the Arduino IDE is used, please check that in the file project_config/lmic_project_config.h (in the top level in this library) the correct configurations are set. The file must look like this:
de: **Achtung:** Wenn die Arduino-IDE verwendet wird, dann bitte prüfen, dass in der Datei project_config/lmic_project_config.h (in der obersten Ebene in dieser Library) die richtigen Einstellungen gesetzt sind. Die Datei muss so aussehen:

source: The specified versions of the libraries are the minimum requirements. We always test with the latest versions too, so please always install and use the latest versions. If the compiler reminds other libraries, please install them in the Arduino IDE via *Sketch -> Include Library -> Manage Libraries ..*.
de: Die angegebenen Versionen der Libraries sind die Mindestanforderungen. Wir testen immer auch mit den neuesten Versionen, deshalb bitte immer die aktuellen Versionen installieren und verwenden. Falls der Compiler andere Libraries anmahnt, diese bitte in der Arduino IDE per Sketch -> Include Library -> Manage Libraries .. installieren.

source: Procedure after startup
de: Ablauf nach dem Start

source: The device establishes its own WiFi access point (AP). The SSID of the AP is **ESP32-xxxxxx**, where the xxx are the chip ID (or MAC address) of the WiFi chip (example: **ESP32-51564452**). **Please write down this number, it will be needed later.** This access point remains active for 30 sec. After that the device tries to connect to the (previously) defined WiFi netwword. This connection attempt also takes 30sec. If no connection could be established, the own AP is created again and the process starts again and again.
de: Das Gerät baut einen eigenen WLAN-Accesspoint (AP) auf. Die SSID des AP lautet **ESP32-xxxxxxxx**, wobei die xxx die Chip-ID (bzw. die MAC-Adresse) des WLAN-Chips sind (Beispiel: **ESP32-51564452**). **Bitte diese Nummer notieren, sie wird später noch gebraucht.** Dieser Access-Point bleibt für 30sec aktiv. Danach versucht das Gerät, sich mit dem (früher) eingestellten WLAN zu verbinden. Dieser Verbindungsversuch dauert ebenfalls 30sec. Kommt keine Verbindung zu Stande, wird wieder der eigene AP erzeugt und der Vorgang fängt wieder und wieder von vorne an.

source: Configuring the device via WiFi
de: Einstellung des WLAN

source: After the WiFi AP of the device appears on your cell phone or computer, connect to it. The connection asks for a password, it is **ESP32Geiger**. The start page of the device opens usually **automatically**. If the start page does not appear, you have to call the address **192.168.4.1** with a browser. The start page appears, where you can’t miss the link to the **configure page** , click on it and you enter the settings page.
de: Nachdem der WLAN-AP des Geräts auf Deinem Handy oder PC erscheint, verbinde Dich mit diesem. Die Verbindung fragt nach einem Passwort, es ist **ESP32Geiger**. Normalerweise öffnet sich automatisch die Startseite des Gerätes. Falls die Startseite nicht erscheint, so muss mit dem Browser die Adresse **192.168.4.1** aufgerufen werden. Die Startseite erscheint und dort findet man einen Link zur **configure page** - dort drauf klicken und man kommt zur Einstellungsseite.

source: The settings page has the following lines:
de: Die Einstellungs-Seite hat die folgenden Zeilen:

source: Geiger accesspoint SSID This is the SSID of the built-in AP and can be changed. If the sensor was already registered with this number at sensor.community, a new registration is mandatory.
de: Geiger accesspoint SSID Dies ist die SSID des eingebauten APs und kann geändert werden. Wenn der Sensor bereits mit dieser Nummer bei sensor.community registriert war, muss eine neue Registrierung erfolgen.

source: Geiger accesspoint password This is the password for the built-in AP. It **MUST** be changed the first time. If desired, the default password **ESP32Geiger** can be used again. The field must not be left blank. Save the password to your favourite password manager.
de: Geiger accesspoint password Dies ist das Passwort für den eingebauten AP. Dieses **MUSS** beim ersten Mal geändert werden. Wenn gewünscht, kann natürlich auch das gleiche Passwort **ESP32Geiger** wieder verwendet werden. Das Eingabefeld darf nicht leer gelassen werden. Sichere das Passwort in Deinem bevorzugten Passwort-Manager.

source: WiFi client SSID Here you have to enter the SSID of the WLAN you want to connect for network/internet access.
de: WiFi client SSID Hier muss die SSID des WLANs für den Netzwerk/Internet-Zugang eingegeben werden.

source: WiFi client password And here the corresponding password.
de: WiFi client password Und hier das zugehörige Passwort.

source: For more security, it is recommended to use a separate WiFi network (e.g. guest network) to ensure an isolated communication from the normal network.
de: Für bessere Sicherheit wird empfohlen, ein separates WLAN-Netzwerk zu verwenden (z.B. das Gast-Netzwerk), um die Kommunikation vom normalen Netzwerk zu abzutrennen.

source: If everything is entered, press **Apply** and the data are stored in the internal EEPROM. Leave this page via **Cancel**, because only in this way the program closes the Config-Mode and connects to the local WiFi network. If there is no **Cancel** Button, go back to the WiFi settings of the device and type in the normal home network parameters again.
de: Ist alles eingegeben, auf **Apply** klicken. Dann werden die eingestellten Daten übernommen und in das interne EEPROM gespeichert. Dann bitte diese Seite über **Cancel** verlassen, weil nur dann das Programm den Config-Mode schliesst und sich mit dem heimischen WLAN verbindet. Wenn es kein **Cancel**-Knopf gibt, dann gehe zurück zu den WLAN-Einstellungen des Geräts und tippe dort die normalen Heim-Netzwerk-Parameter wieder ein.

source: **CAUTION**. **When updating to version 1.13, the WiFi settings must be re-entered**. In future versions this step shall become obsolete.
de: **ACHTUNG**, **Beim Update auf die Version 1.13 müssen die WLAN-Daten noch einmal neu eingegeben werden**. Bei zukünftigen Versionen wird das nicht mehr nötig sein.

source: Furthermore, the following options can be defined on the settings page:
de: Weiter können über die Einstell-Seite einige verschiedene Definitionen festgelegt werden:

source: Start melody, speaker tick, LED tick and display on/off.
de: Start-Melodie, Lautsprecher-Tick, LED-Tick und Anzeige jeweils an oder aus

source: Send data to sensor.community or/and to madavi.de
de: Daten senden zu sensor.community oder/und zu madavi.de

source: If LoRa hardware is available: the LoRa parameters (DEVEUI, APPEUI and APPKEY) can be entered here.
de: bei LoRa-Hardware können hier auch die LoRa-Parameter (DEVEUI, APPEUI und APPKEY) eingegeben werden.

source: The firmware on the MultiGeiger can be updated with the link **Firmware update** at the End of the settings page. Download the .bin file, select it via **Browse…** and click **Update**. It will take roughly 30sec for uploading and flashing the firmware. If you see **Update Success! Rebooting…**, the MultiGeiger will reboot and the new firmware will be active.
de: Am Ende der Einstellungsseite gibt es einen Link **Firmware update** - hiermit kann man die Firmware auf dem MultiGeiger aktualisieren. Die .bin-Datei runterladen, dann diese über **Browse..** auswählen und **Update** klicken. Es dauert ca. 30sec für das Hochladen und Flashen der Firmware. Wenn Du dann **Update Success! Rebooting...** siehst, startet der MultiGeiger neu und die neue Firmware ist dann aktiv.

source: If **Update error: …** appears, the update did not work. The previous firmware is still active.
de: Erscheint **Update error: ...**, dann hat das Update nicht geklappt - es ist dann die seitherige Firmware weiter aktiv.

source: The settings page can be called up from your own WiFi at any time. To do this, just enter in the address bar of the browser: http://esp32-xxxxxxx (xxxxx is the chip ID – see above). If it does not work with this hostname, use the IP address of the Geiger counter instead. The Ip address can be found in the devices list in your router. If successful, the login page appears. Enter **admin** as username and the chosen password (see above). Now you will see the settings page as described.
de: AN Die Einstellseite kann zu jeder Zeit aus dem eigenen WLAN heraus aufgerufen werden. Dazu wird in der Adresszeile des Browsers http://esp32-xxxxxxx eingegeben (xxxxxxx ist die Chip-ID - siehe oben). Sollte es mit diesem Hostnamen nicht klappen, dann muss die IP-Adresse des Geigerzählers verwendet werden. Diese kann aus dem Router ausgelesen werden. Bei Erfolg erscheint zunächt eine Login-Seite. Hier ist als Username **admin** und als Passwort das ausgewählte Passwort (siehe oben) einzugeben. Dann erscheint die gleiche Einstellseite wie beschrieben.

source: Server for measured data
de: Server für die Messdaten

source: The pulses are counted for one measuring cycle at a time, from which the “counts per minute” (cpm) are calculated. After each cycle the data is sent to the servers at *sensor.community* and at *madavi.de*.
de: Es werden jeweils einen Messzyklus lang die Impulse gezählt und dann die "Counts per Minute" (cpm) berechnet. Jeweils nach diesem Zyklus werden die Daten zu den Servern bei *sensor.community* und bei *madavi.de* gesendet.

source: At *sensor.community* the data is stored and made available for retrieval the next day as CSV file. This file can be found at http://archive.sensor.community/DATE/DATE_radiation_si22g_sensor_SID.csv), where DATE = date in format YYYY-MM-DD (both times equal) and SID is the sensor number of the sensor (**not** the ChipID). For other sensors, replace the counting tube name **si22g** with the corresponding name (e.g.: sbm-20 or sbm-19).
de: Bei *sensor.community* werden die Daten gespeichert und stehen am nächsten Tag zum Abruf als CSV-Datei bereit. Diese Datei findet man unter http://archive.sensor.community/DATE/DATE_radiation_si22g_sensor_SID.csv) wobei DATE = Datum im Format YYYY-MM-DD ist (beides mal gleich) und SID die Sensornummer des Sensors (**nicht** die ChipID). Für andere Sensoren ist der Zählrohr-Name **si22g** durch den entsprechenden Namen zu ersetzen (z.B.: sbm-20 oder sbm-19).

source: At *madavi* the data is stored in a RRD database and can be accessed directly as a graph via this link: https://www.madavi.de/sensor/graph.php?sensor=esp32-CHIPID-si22g. Here CHIPID is the ChipId (the digits of the SSID of the internal access point).
de: Bei *madavi* werden die Daten in einer RRD-Datenbank abgelegt und können direkt als Grafik über diesen Link aufgerufen werden: https://www.madavi.de/sensor/graph.php?sensor=esp32-CHIPID-si22g Hier ist dann CHIPID die ChipId (also die Ziffern der SSID des internen Accesspoints).

source: During the transmission of the data to the servers, the name of the server is briefly shown in the status line (bottom line) of the display.
de: Während der Übertragung der Daten zu den Servern wird in der Statuszeile (unterste Zeile) des Displays kurz der Name des Servers eingeblendet.

source: Login to sensor.community
de: Anmelden bei sensor.community

source: In order to send the measuered data to sensor.community, it is mandatory to have a valid account and the sensor is registered. Both can be done at https://devices.sensor.community. Create an account if you do not have one via the *Register* button and log in. To register a new sensor click *Register new sensor*. Fill in the form:
de: Um Mess-Daten an sensor.community zu senden, muss man dort ein gültiges Konto haben und der Sensor muss registriert sein. Beides kann man auf https://devices.sensor.community erledigen. Wenn man noch kein Konto hat, über "Register" eins anlegen und sich einloggen. Um einen neuen Sensor zu registrieren, auf "Register new sensor" klicken und das Formular ausfüllen:

source: Sensor ID: Enter the number (only the numbers) of the SSID of the sensor (e.g. for the sensor ESP-51564452 enter 51564452).
de: Erste Zeile, Sensor ID: Hier die Nummer (nur die Zahlen) der SSID des Sensors eingeben (z.B. bei dem Sensor ESP-51564452 dann nur 51564452 eingeben).

source: Sensor Board: Select *esp32* (by the small arrows on the right)
de: Zweite Zeile, Sensor Board: *esp32* auswählen (über die kleinen Pfeile rechts)

source: Basic information: Enter the address and the country. The internal name of the sensor can be assigned arbitrarily, but must be entered. Please check **Indoor sensor** as long as the sensor operates not outdoor.
de: Basisinformation: Hier die Adresse mit Land eingeben. Der interne Name des Sensors kann beliebig vergeben werden, muss aber eingegeben werden. Bitte den Haken bei **Indoor-Sensor** setzen, solange der Sensor nicht draussen aufgestellt ist.

source: Additional information: Can be left blank, but its nice to provide further information.
de: Zusätzliche Informationen: Kann leer gelassen werden, es ist aber nett, um zusätzliche Informationen anzugeben.

source: Hardware configuration: Select the sensor type **Radiation Si22G** (or accordingly). The value for the second sensor can remain DHT22, as it is irrelevant in this context.
de: Hardware-Konfiguration: Hier als Sensor-Typ den Eintrag **Radiation Si22G** (oder ggf. entsprechend) auswählen. Für den zweiten Sensor kann DHT22 stehen bleiben, das ist für uns irrelevant.

source: Position: Please enter the coordinates as accurate as possible. You can use the right button to calculate the coordinates. They are needed to show your sensor on the map.
de: Position: Hier bitte so genau wie möglich die Koordinaten eingeben. Man kann den rechten Knopf benutzen, um die Koordinaten berechnen lassen. Diese werden benötigt, um den Sensor auf der Karte anzuzeigen.

source: Finish the settings by clicking *Save settings*. At the overview page for this sensor go to *Data*. Here you see amongst others the ID of the sensor. Please remember: the ID mandatory for the queries at sensor.community or multigeiger.citysensor.de.
de: Nun mit "Save settings" die Einstellungen beenden. Auf der Übersichts-Seite für diesen Sensor auf *Data* klicken. Hier kann man u.a. die Sensor ID sehen. Immer dran denken: die ID wird für Abfragen auf sensor.community oder multigeiger.citysensor.de zwingend benötigt.
