Repository: M-a-r-i-a-n-n-e/MultiGeiger
Catalog: locales/*/LC_MESSAGES/setup_lora.po
Languages: de

source: The MultiGeiger can be connected with the followng steps to TTN (“The Things Network”):
de: Der Multigeiger kann mit den folgenden Schritten an TTN ("The Things Network") angebunden werden:

source: Create the TTN device in your profile at *The Things Network*
de: Anlegen des TTN-Devices in Deinem Profil bei *The Things Network*

source: Transfer the parameters to the multi-pointer
de: Übernehmen der Parameter in den Multigeiger

source: Login at *sensor.community* (former luftdaten.info)
de: Anmelden bei sensor.community (ehemals luftdaten.info)

source: Creating a TTN device
de: Anlegen eines TTN-Devices

source: The device must be registered with TTN. To do this, an account must first be created at TTN (if one does not already exist).
de: Das Gerät muss bei TTN registriert werden. Dazu muss zuerst (falls noch nicht vorhanden) ein Konto bei TTN angelegt werden.

source: Create TTN account
de: TTN-Konto anlegen

source: At https://account.thethingsnetwork.org/register you have to enter a **USERNAME**, the **EMAIL ADDRESS** and a **PASSWORD**. Then right down over **Create account** create the account. After that you can log in to the console with the new data (https://account.thethingsnetwork.org/users/login).
de: Bei https://account.thethingsnetwork.org/register einen **USERNAME**, die **EMAIL ADRESSE** und ein PASSWORD eingeben. Dann rechts unten über **Create account** das Konto anlegen. Danach kann man sich mit den neuen Daten an der Console anmelden (https://account.thethingsnetwork.org/users/login).

source: Create application
de: Applikation anlegen

source: After you have logged in successfully, create the new application via **APPLICATIONS** and **add applications**. The following fields must be filled in:
de: Nachdem man sich eingelogged hat, über **APPLICATIONS** und **add applications" eine neue Applikation anlegen. Folgende Felder müssen ausgefüllt werden:

source: **Application ID:** Any name for this application, but it must not yet exist in the network (e.g.: geiger_20200205).
de: **Application ID:** Ein beliebiger Name für diese Applikation, die darf es aber in dem Netzwerk noch nicht geben (z.B.: geiger_20200205)

source: **Description:** Any description of the application can be entered here.
de: **Description:** Hier kann eine beliebige Beschreibung der Applikation eingegeben werden.

source: **Application EUI:** Remains empty, the number is generated by the TTN system.
de: **Application EUI:** Bleibt frei, die Nummer wird vom TTN-System erzeugt.

source: **Handler registration:** The pre-filled value (ttn-handler-eu) is already correct and remains.
de: **Handler registration:** Der vorausgefüllte Wert (ttn-handler-eu) ist schon richtig und bleibt so stehen.

source: Now add the application with **Add application** in the lower right corner.
de: Nun mit **Add application** rechts unten die Applikation hinzufügen.

source: Create device
de: Gerät anlegen

source: Finally, the device has to be created. To do this, select the newly created application in the overview of applications (click). Then in the middle area at **DEVICES** start the creation of a new device via **register device**. The following fields must be filled in:
de: Zuletzt muss noch das Gerät angelegt werden. Dazu in der Übersicht der Applikationen die gerade neu angelegte Applikation auswählen (klicken). Hier dann im mittleren Bereich bei **DEVICES** das Anlegen eines neuen Geräts über **register device** starten. Folgende Felder müssen ausgefüllt werden:

source: **Device ID:** Any name for the device. It must be unique within the application (e.g.: geiger_01) and consist only of lower-case letters.
de: **Device ID:** Ein beliebiger Name für das Gerät. Er muss innerhalb der Applikation eindeutig sein (also z.B.: geiger_01) und nur aus Kleinbuchstaben bestehen.

source: **Device EUI:** Click once on the symbol on the far left of the line, then the text appears that this number is generated by the system. We don’t have to enter anything else.
de: **Device EUI:** Einmal auf das Symbol ganz links an der Zeile klicken, dann erscheint der Text, dass diese Nummer vom System erzeugt wird. Wir müssen sonst nichts weiter eingeben.

source: **App Key:** No input necessary
de: **App Key:** Keine Eingabe nötig

source: **App EUI:** Stays like this
de: **App EUI:** Bleibt so stehen

source: Click on **Register** in the lower right corner. Congratulations, the device is created.
de: Nun rechts unten auf **Register** klicken. Nun ist auch das Gerät angelegt.

source: Modifying the LoRa parameters
de: Übernahme der LoRa-Parameter

source: After the registration was completed, the LoRa parameters can be transferred to the program.
de: Nach erfolgter Registrierung, können die LoRa-Parameter in das Programm übernommen werden.

source: They can be set up at the configuration site of the Geiger counter (see above).
de: Diese können auf der Konfigurations-Seite des Geigerzählers eingestellt werden (siehe oben).

source: Go through the configuration site until the settings of the LoRa parameters are displayed. Type in the 3 parameters from the TTN console (**APPEUI, DEVEUI, APPKEY**). They can be found in your TTN account for each device (see above). The HEX values must be entered **without** spaces as they appear in the TTN.
de: Nun auf der Konfigurations-Seite durch die Konfiguration gehen bis die Einstellung der LoRa-Parameter angezeigt wird. Nun die 3 Werte (APPEUI, DEVEUI, APPKEY) aus der TTN-Console (siehe oben) entnehmen und hier dann eintragen. In der TTN-Console auf das Device gehen, das oben angelegt wurde. Hier sind die 3 Werte zu finden. Es müssen die HEX-Werte ohne Leerzeichen eingegeben werden, und zwar so, wie sie in der TTN-Console erscheinen.

source: Example: | The TTN console reads
de: Beispiel: In der TTN-Console steht

source: Then the following must be entered:
de: Dann muss Folgendes eingeben werden:

source: This is also applies to **APPEUI** and **APPKEY** .
de: Dies gilt genauso ebenso für die **APPEUI** und den **APPKEY**.

source: Logging data into sensor.community (formerly luftdaten.info)
de: Daten loggen zu sensor.community (ehem. luftdaten.info)

source: If you want the MultiGeiger to pass recorded data to *sensor.community* via TTN, you have to register it. The registration is similar to the TTN registration described above. In the following, only the changes are explained:
de: Wenn der Multigeiger seine Daten über TTN auch an *sensor.community* weitergeben soll, muss er dort angemeldet werden. Die Anmeldung ist ähnlich wie oben für TTN beschrieben. Hier werden nur die Änderungen erläutert:

source: Sensor ID: Enter the last 4 bytes of the DEVEUI in left to right order (e.g. if the DEVEUI is *00 D0 C0 00 C3 19 7C E8*, so enter *C3197CE8*), but converted to decimal, not in HEX (finally: 3273227496).
de: Sensor ID: Die letzten 4 bytes der DEVEUI von links nach rechts eingeben (z. B. wenn die DEVEUI *00 D0 C0 00 C3 19 7C E8* ist, dann *C3197CE8* eingeben), aber in dezimal umgerechnet, nicht in HEX (letztendlich: 3273227496).

source: Sensor Board: Select **TTN**, using the small arrows on the right.
de: Sensor Board: **TTN** auswählen über die kleinen Pfeile rechts.

source: To get the data from TTN to *sensor.community* you have to enable the HTTP integration at TTN. In the TTN console click *Applications* and then click on the application of the GeigerCounter (e.g. *geiger_20200205*). On the top right in the bar with *Overview*, *Devices*, *Payload Formats*, *Integrations*, *Data*, *Settings* click **Integrations**. Then select **HTTP Integration** via **add integration**.
de: Um die Daten über TTN zu **sensor.community** zu bekommen, muss noch die HTTP-Integration bei TTN aktiviert werden. In der TTN-Console **Applications** anklicken und dann die Applikation des Geigerzählers (z. B. *geiger_20200205*) anklicken. Dann rechts oben in der Leiste mit *Overview*, *Devices*, *Payload Formats*, *Integrations*, *Data*, *Settings* das **Integrations** anklicken. Hier dann über **add integration** die **HTTP Integration** auswählen.

source: Now fill in the displayed fields:
de: Nun die angezeigten Felder ausfüllen:

source: **Process ID** Enter any name for this integration here **Access Key:** Click here once and select the *default key*
de: **Process ID:** Hier einen beliebigen Namen für diese Integration vergeben **Access Key:** Hier einmal rein klicken und den *default key* auswählen

source: **URL:** Enter the URL for the ttn2luft program: https://ttn2luft.citysensor.de
de: **URL:** Hier die URL zum ttn2luft-Programm eingeben: https://ttn2luft.citysensor.de

source: **Method:** If it reads already *POST*, don’t touch it
de: **Method:** Wenn dort schon *POST* steht, nicht ändern

source: **Authorization:** remains empty
de: **Authorization:** bleibt leer

source: **Custom Header Name:** here comes the text **X-SSID** pure
de: **Custom Header Name:** hier kommt der Text **X-SSID** rein

source: **Custom Header value:** Enter the SSID of the sensor (the number you got when you registered at sensor.community, *NOT* the chip ID).
de: **Custom Header value:** Die SSID des Sensors eingeben (also die Nummer, die man bei der Anmeldung bei sensor.community erhalten hat, **NICHT** die Chip-ID).

source: Click **Add integration** in the lower right corner to confirm the changes.
de: Dann rechts unten auf **Add integration** klicken, um die Änderungen zu bestätigen.

source: See this example how the form should look like: |“HTTP Integration filled”|
de: Siehe dieses Beispiel, wie das Formular aussehen sollte:

source: TTN payload (example)
de: TTN-Payload (Beispiel)

source: In order to get readable values in the TTN console instead of solely data bytes, a small script can be inserted as payload decoder. Go to the TTN website, log in, click **Applications** to find the application you created above. Select the tab **Payload Formats** in the menu bar and paste the following code into the field. Existing code will be overwritten):
de: Um in der TTN-Console nicht nur die Datenbytes sondern lesbare Werte zu sehen, kann ein kleines Script als Payload-Decoder eingefügt werden. Auf der TTN-Webseite einloggen, über **Applications** die oben angelegte Application suchen. Hier in der Menü-Zeile den Tab **Payload Formats** auswählen und den folgenden Code in das Feld einfügen. Vorhandener Code wird überschreiben):
